Revit 2024 API
IFCImportOptions Class
 IFC Import options.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class IFCImportOptions : IDisposable
Visual Basic
Public Class IFCImportOptions _
	Implements IDisposable
Visual C++
public ref class IFCImportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCImportOptions
See Also
IFCImportOptions Members
Autodesk.Revit.DB.IFC Namespace